In [1]:
import pandas as pd

In [53]:
df = pd.read_excel('Real_Estate_Data_Analytics.xlsx')
df_2 = pd.read_excel('Real_Estate_Data_Analytics.xlsx', sheet_name = 'Product Inventory & Pricing')

In [54]:
df.head()

,Customer Name,Product Type Purchased,Quantity Purchased,Amount Paid,Country,Sales Person
0,Customer 1,Villa,1,351119.25,USA,Chris Johnson
1,Customer 2,Commercial Space,5,1431865.75,South Africa,Chris Johnson
2,Customer 3,Commercial Space,2,38465.10,Kenya,Jane Smith
3,Customer 4,Apartment,2,718575.73,South Africa,Jane Smith
4,Customer 5,Apartment,3,552330.63,UAE,John Doe

### Identify the top 3 most purchased product types

In [58]:
df['Product Type Purchased'].value_counts().head(3)

Product Type Purchased
Villa            185
Terrace House    169
Apartment        167
Name: count, dtype: int64

### Most effective sales person

In [63]:
df.groupby('Sales Person')['Amount Paid'].sum().reset_index()

    Sales Person   Amount Paid
0  Chris Johnson  1.198684e+08
1     Jane Smith  9.842566e+07
2       John Doe  1.249795e+08
3   Laura Wilson  1.036186e+08
4  Michael Brown  1.170992e+08

### Total Revenue from all sales

In [66]:
df['Amount Paid'].sum()

563991410.8000001

In [78]:
df_2

       Product Type  Available Quantity  Invoice Amount       Cost
0              Land                 910       494860.93  406090.23
1         Apartment                 615       305732.80  250208.17
2  Commercial Space                 940       401474.79  326980.46
3             Villa                 605       352381.48  298507.96
4            Duplex                 590       118258.07  103983.70
5     Terrace House                 410       335581.41  282944.36

### Compare the cost to the Invoice amount and check who has the highest profitability

In [90]:
df_2['Profitability'] = df_2['Invoice Amount'] - df_2['Cost']

In [92]:
df_2['Profitability'].head(6)

0    88770.70
1    55524.63
2    74494.33
3    53873.52
4    14274.37
5    52637.05
Name: Profitability, dtype: float64

In [94]:
df_2.loc[df_2['Profitability'].idxmax()]

Product Type               Land
Available Quantity          910
Invoice Amount        494860.93
Cost                  406090.23
Profitability           88770.7
Name: 0, dtype: object

### Identify customers who made the highest payment

In [60]:
df[df['Amount Paid'] == 2372254.16]['Sales Person'] # First method

249    Jane Smith
Name: Sales Person, dtype: object

In [97]:
df.loc[df['Amount Paid'].idxmax()] # Second method

Customer Name             Customer 250
Product Type Purchased            Land
Quantity Purchased                   5
Amount Paid                 2372254.16
Country                   South Africa
Sales Person                Jane Smith
profitability                      NaN
Name: 249, dtype: object